#+BABEL: :comments no
#+VERSION: 0.03a
 
**** Code
    :PROPERTIES:
    :ID:       6f9f2e24-8e1d-4cbf-9fc4-bfe3a13a9b0f
    :END:
#+srcname: class_OrgClock
#+begin_src python :tangle PyOrgMode.py :exports code
  class OrgClock(OrgPlugin):
      """Plugin for Clock elements"""
      def __init__(self):
          OrgPlugin.__init__(self)
          self.regexp = re.compile("(?:\s*)CLOCK:(?:\s*)((?:<|\[).*(?:>||\]))--((?:<|\[).*(?:>||\])).*=>\s*(.*)")
      def _treat(self,current,line):
          clocked = self.regexp.findall(line)
          if clocked:
              self._append(current,self.Element(clocked[0][0], clocked[0][1], clocked[0][2]))
          else:
              self.treated = False
          return current
     
      class Element(OrgElement):
          """Clock is an element taking into account CLOCK elements"""
          TYPE = "CLOCK_ELEMENT"
          def __init__(self,start="",stop="",duration=""):
              OrgElement.__init__(self)
              self.start = OrgDate(start)
              self.stop = OrgDate(stop)
              self.duration = OrgDate(duration)
          def _output(self):
              """Outputs the Clock element in text format (e.g CLOCK: [2010-11-20 Sun 19:42]--[2010-11-20 Sun 20:14] =>  0:32)"""
              return "CLOCK: " + self.start.get_value() + "--"+ self.stop.get_value() + " =>  "+self.duration.get_value()+"\n"
  
#+end_src
*** RegExLab
This part is used for internal testing. It allows you to test some piece of code inside your org document.
    :PROPERTIES:
    :ID:       906a3e71-fba9-43a1-bed4-2ec5a120024d
    :END:
Just use C-c C-c to execute this code
#+srcname: regexlab.org
#+begin_src python :exports code
import re
test_regexp = re.compile("")
result = test_regexp.findall("")
return(result)
#+end_src

#+results: regexlab.org
|   |

